docs/assign04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-06 Tue 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 4</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 4</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org45bab57">1. Goals: Rep-Invariants, contracts, tests</a></li>
<li><a href="#org0db468b">2. Grading Criteria</a></li>
<li><a href="#org88b188e">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org45bab57" class="outline-2">
<h2 id="org45bab57"><span class="section-number-2">1</span> Goals: Rep-Invariants, contracts, tests</h2>
<div class="outline-text-2" id="text-1">
<p>
Revisit the mutable Poly example from <a href="./assign03.html">assignment 3</a>. That is, use the one based on a map, not an array.
</p>

<ol class="org-ol">
<li>Implement <code>repOk()</code>.</li>
<li>Introduce a fault (i.e. "bug") that breaks the rep-invariant. Try to do this with a small (conceptual) change to the code. Show that the rep-invariant is broken with a JUnit test.</li>
<li>Analyzed your bug with respect to the various contracts/methods in Poly. Are all/some/none of the contracts violated?</li>
<li>Do you think your fault is realistic? Why or why not?</li>
</ol>

<p>
As in assignment 3, your deliverable is a <b>story</b>, with exactly the same rationale. Take screenshots (e.g. of failing JUnit tests) as necessary to make your case.
</p>
</div>
</div>

<div id="outline-container-org0db468b" class="outline-2">
<h2 id="org0db468b"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Correctness of solution</li>
<li>Clarity of story</li>
</ul>
<p>
Note: If your group had trouble with the previous assignment, feel free to appeal to your classmates to post a sample solution on Piazza.
</p>
</div>
</div>


<div id="outline-container-org88b188e" class="outline-2">
<h2 id="org88b188e"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
